Repository: martinstanicio/rackmaster
Catalog: locales/*/LC_MESSAGES/*.po
Languages: es

# menu_file
source: File
es: Archivo

# menu_inbound
source: Inbound operation
es: Operación entrante

# menu_outbound
source: Outbound operation
es: Operación saliente

# menu_internal
source: Internal movement
es: Movimiento externo

# db_populate_error
source: An error ocurred while populating the database
es: Hubo un error al llenar la base de datos

source: Invalid quantity
es: Cantidad inválida

# quantity_must_be_integer
source: Quantity must be an integer
es: La cantidad debe ser un número entero

source: Quantity must be greater than 0
es: La cantidad debe ser mayor que 0

source: Invalid coordinates
es: Coordinadas inválidas

# coordinates_out_of_bounds
source: Coordinates are out of bounds
es: Las coordinadas estan fuera de los limites

source: Slot at
es: El slot en

# slot_at_blocked
source: is blocked
es: está bloqueado

# slot_at_not_empty
source: is not empty
es: no está vacío

# operation_cancelled
source: Operation was cancelled
es: La operación ha sido cancelada

# cannot_swap_blocked_slots
source: Cannot swap pallets with blocked slots
es: No es posible intercambiar slots bloqueados

# quantity_must_be_non_negative
source: quantity must be a non negative number
es: La cantidad no puede ser negativa

# status_must_be_in_enum
source: `status` must be 'blocked', 'full_pallet', or 'divided_pallet'
es: El estado (`status`) debe ser bloqueado ('blocked'), pallet completo ('full_pallet'), o pallet dividido ('divided_pallet')

source: Full pallet
es: Pallet completo

source: Divided pallet
es: Pallet dividido

source: Blocked
es: Bloqueado

source: Empty
es: Vacío

source: Please enter valid coordinates
es: Por favor, ingrese coordenadas validas

# please_enter_article_code
source: Please enter an article code
es: Por favor, ingrese un código de articulo

source: Article code
es: Código de articulo

source: Quantity
es: Cantidad

source: Get article slots
es: Obtener slots de articulo

source: Get free slots
es: Obtener slots libres

source: Free slots
es: Slots libres

source: Get slot
es: Obtener slot

source: Slot coordinates
es: Coordenadas del slot

source: Slot does not exist
es: El slot no existe

source: Register inbound
es: Registrar operación entrante

source: Use full pallet?
es: ¿Usar pallet completo?

source: Inbound registered successfully
es: Operación entrante registrada correctamente

source: Swap pallets
es: Intercambiar pallets

# slot_at_does_not_exist
source: does not exist
es: no existe

source: Pallets swapped successfully
es: Pallets intercambiados correctamente
